In [2]:
# 조건으로 검색하기

import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
pd.DataFrame(np.random.rand(5,2),columns=['A','B'])

          A         B
0  0.383694  0.733511
1  0.568167  0.844425
2  0.801734  0.784032
3  0.897742  0.818985
4  0.193260  0.238258

In [6]:
df =pd.DataFrame(np.random.rand(5,2),columns=['A','B'])

print(df['A'])
print()
print(df['A']<0.5)
print()
print(df[(df['A']<0.5)&(df['B']>0.3)])

0    0.066603
1    0.474558
2    0.860050
3    0.949972
4    0.879456
Name: A, dtype: float64

0     True
1     True
2    False
3    False
4    False
Name: A, dtype: bool

          A         B
0  0.066603  0.392460
1  0.474558  0.510702

In [7]:
print(df[(df['A']<0.5)&(df['B']>0.3)])
print()
condition = (df['A']<0.5)&(df['B']>0.3)
print(df[condition])
print()
print(df.query('A<0.5 and B >0.3'))

          A         B
0  0.066603  0.392460
1  0.474558  0.510702

          A         B
0  0.066603  0.392460
1  0.474558  0.510702

          A         B
0  0.066603  0.392460
1  0.474558  0.510702

In [9]:
# 문자열 조건 검색

data = {
    'Animal' : ["Dog", "Cat","Cat","Pig","Cat"],
    'Name' : ["Happy","Sam","Tom","Mini","Rocky"]
}

In [10]:
df = pd.DataFrame(data)
df.head()

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat    Tom
3    Pig   Mini
4    Cat  Rocky

In [11]:
df['Animal'].str.contains('Cat')        # Animal 열에서 고양이가 맞으면 True 아니면 False
# str.contains() 문자중에  검색하는 문자가 포함되어 있는지 확인(True/False)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [12]:
df.Animal.str.match("Cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [13]:
df[df['Animal'].str.contains('Cat')]

  Animal   Name
1    Cat    Sam
2    Cat    Tom
4    Cat  Rocky

In [14]:
# 대 소문자 구분 없이 검색하기 --> case = False
df['Animal'].str.contains('Cat', case = False)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [18]:
# 함수로 데이터 처리하기

pd.DataFrame(np.arange(5),columns=["num"])

   num
0    0
1    1
2    2
3    3
4    4

In [21]:
# apply() : 함수를 받아서 적용

df = pd.DataFrame(np.arange(5),columns=["num"])

def square(x):
    return x**2


print(df)
print()
print(df['num'])


print(df['num'].apply(square))

   num
0    0
1    1
2    2
3    3
4    4

0    0
1    1
2    2
3    3
4    4
Name: num, dtype: int32
0     0
1     1
2     4
3     9
4    16
Name: num, dtype: int64

In [22]:
# new columns 생성 후 데이터프레임에 삽입
df['square'] = df['num'].apply(square)

print(df)

   num  square
0    0       0
1    1       1
2    2       4
3    3       9
4    4      16

In [23]:
df.num
# df['num']과 같음

0    0
1    1
2    2
3    3
4    4
Name: num, dtype: int32

In [24]:
df.num.apply(lambda x : x**2)

0     0
1     1
2     4
3     9
4    16
Name: num, dtype: int64

In [25]:
df['square_lambda'] = df.num.apply(lambda x : x**2)

print(df)

   num  square  square_lambda
0    0       0              0
1    1       1              1
2    2       4              4
3    3       9              9
4    4      16             16

In [28]:
# 함수로 데이터 처리하기

df =pd.DataFrame(columns=['phone'])

df.loc[0] = '010-1234-5678'
df.loc[1] = '공일공-일이삼사-오육칠팔'
df.loc[2] = '010.1234.오육칠팔'
df.loc[3] = '공1공-1234-5육7팔'
df['preprocess_phone'] = ''

In [29]:
df

           phone preprocess_phone
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
2  010.1234.오육칠팔
3  공1공-1234-5육7팔

In [33]:
def 전처리(phone):
    mapping = {
        '공' : '0',
        '일' : '1',
        '이' : '2',
        '삼' : '3',
        '사' : '4',
        '오' : '5',
        '육' : '6',
        '칠' : '7',
        '팔' : '8',
        '구' : '9',
        '-' : ' ',
        '.' : ' '
    }
    for key, value in mapping.items():
        phone = phone.replace(key, value)
    return phone                            # return 의 자리 조심

In [31]:
df['phone']

0    010-1234-5678
1    공일공-일이삼사-오육칠팔
2    010.1234.오육칠팔
3    공1공-1234-5육7팔
Name: phone, dtype: object

In [34]:
df['phone'].apply(전처리)

0    010 1234 5678
1    010 1234 5678
2    010 1234 5678
3    010 1234 5678
Name: phone, dtype: object

In [37]:
df['preprocess_phone'] = df['phone'].apply(전처리)
df

           phone preprocess_phone
0  010-1234-5678    010 1234 5678
1  공일공-일이삼사-오육칠팔    010 1234 5678
2  010.1234.오육칠팔    010 1234 5678
3  공1공-1234-5육7팔    010 1234 5678

In [39]:
# replace : apply 기능에서 데이터 값만 대체하고 싶을 때 사용

data = {'0': 'Male',
        '1' :'Male',
        '2' : 'Female',
        '3' : 'Female',
        '4' : 'Male'
        }

data

{0: 'Male', 1: 'Male', 2: 'Female', 3: 'Female', 4: 'Male'}

In [41]:
data.values()

dict_values(['Male', 'Male', 'Female', 'Female', 'Male'])

In [42]:
list(data.values())

['Male', 'Male', 'Female', 'Female', 'Male']

In [43]:
data_list = list(data.values())

In [46]:
pd.DataFrame(data_list,columns=['Sex'])

      Sex
0    Male
1    Male
2  Female
3  Female
4    Male

In [47]:
df = pd.DataFrame(data_list,columns=['Sex'])

df.Sex.replace({"Male" : 0,
                "Female": 1})

# 라벨 인코딩(0,1 인코딩)

0    0
1    0
2    1
3    1
4    0
Name: Sex, dtype: int64

In [49]:
df.Sex.replace({"Male" : 0,
                "Female": 1},inplace= True) 
# inplace = True 는 DataFrame에 바로 적용되는 것

In [50]:
df

   Sex
0    0
1    0
2    1
3    1
4    0

In [51]:
# 그룹으로 묶기
# 조건부로 집계하고 싶은 경우

pd.DataFrame({'key':['A','B','C','A','B','C'],
              'data': range(6)})

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [52]:
df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                 'data': range(6)})

df.head()

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4

In [53]:
df.groupby('key')

In [55]:
df.groupby('key').sum()
# 'key' 별로 묶어서 각각 key별로 더해줘

     data
key
A       3
B       5
C       7

In [56]:
df.groupby(['key','data']).sum()

Empty DataFrame
Columns: []
Index: [(A, 0), (A, 3), (B, 1), (B, 4), (C, 2), (C, 5)]

In [58]:
# aggregate
# groupby 를 통해서 집계를 한번에 계산하고자 할 때

data = {
    'group' : ['A','B','A','B','A','B','A','B'],
    'data1' : [20,30,40,20,30,40,30,50],
    'data2' : [1,2,3,4,5,6,7,8]
}

pd.DataFrame(data)

  group  data1  data2
0     A     20      1
1     B     30      2
2     A     40      3
3     B     20      4
4     A     30      5
5     B     40      6
6     A     30      7
7     B     50      8

In [59]:
df = pd.DataFrame(data)

In [62]:
df.groupby('group').aggregate(['min','median','max'])  # 왜 중앙값에만 np가 붙을까

      data1            data2
        min median max   min median max
group
A        20   30.0  40     1    4.0   7
B        20   35.0  50     2    5.0   8

In [64]:
df.groupby('group').aggregate({'data1':'min','data2':'sum'})

       data1  data2
group
A         20     16
B         20     20